constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    free
    {
        type            patch;
        nFaces          400;
        startFace       319200;
    }
    cyc1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          160000;
        startFace       319600;
    }
    cyc2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          160000;
        startFace       479600;
    }
    sphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       639600;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       640000;
    }
)

// ************************************************************************* //
